==========
Instruction with register address without offset
==========
la $t0, ($s0)
---
(program
  (instruction
    (opcode)
    (operands
      (register)
      (address
        (register)))))

==========
Instruction with decimal offset address
==========
la $t0, -100($s0)
---
(program
  (instruction
    (opcode)
    (operands
      (register)
      (address
        (decimal)
        (register)))))

==========
Instruction with label offset address
==========
la $t0, test($s0)
---
(program
  (instruction
    (opcode)
    (operands
      (register)
      (address
        (symbol)
        (register)))))

==========
Instruction with address using simple expression offset
==========
la $t0, test+100($s0)
---
(program
  (instruction
    (opcode)
    (operands
      (register)
      (address
        (binary_expression
          (symbol)
          (decimal))
        (register)))))

==========
Instruction with address using parenthesized expression offset
==========
la $t0, (test+0x123)($s0)
---
(program
  (instruction
    (opcode)
    (operands
      (register)
      (address
        (parenthesized_expression
          (binary_expression
            (symbol)
            (hexadecimal)))
        (register)))))

==========
Instruction with address using label offset
==========
la $t0, test($s0)
---
(program
  (instruction
    (opcode)
    (operands
      (register)
      (address
        (symbol)
        (register)))))
