==========
Line comment
==========
# This is a comment
---
(program
  (comment))

==========
Inline comment following instruction without operands, no space
==========
nop# This is an in-line comment
---
(program
  (instruction
    (opcode))
  (comment))

==========
Inline comment following instruction without operands, space
==========
nop # This is an in-line comment
---
(program
  (instruction
    (opcode))
  (comment))

==========
Inline comment following instruction with operands, no space
==========
jr $t0# This is an in-line comment
---
(program
  (instruction
    (opcode)
    (operands
      (register)))
  (comment))

==========
Inline comment following instruction with operands, space
==========
jr $t0 # This is an in-line comment
---
(program
  (instruction
    (opcode)
    (operands
      (register)))
  (comment))


==========
Inline comment following directive without arguments
==========
.text # comment
---
(program
  (directive
    (control_mnemonic))
  (comment))

==========
Inline comment following directive with single argument
==========
.align 4 # comment
---
(program
  (directive
    (control_mnemonic)
    (control_operands
      (decimal)))
  (comment))

==========
Inline comment following directive with multiple arguments
==========
.word 1, 2, 3, 4 # comment
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (decimal)))
  (comment))

==========
Comment in multiline directive
==========
mat_A: .word 1 02 '3'
             2 01 '2'# comment
             3 02 '1'
---
(program
  (label)
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (octal)
      (char)
      (decimal)
      (octal)
      (char)
      (comment)
      (decimal)
      (octal)
      (char))))

==========
Comment in multiline directive with space before
==========
mat_A: .word 1 02 '3'
             2 01 '2' # comment
             3 02 '1'
---
(program
  (label)
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (octal)
      (char)
      (decimal)
      (octal)
      (char)
      (comment)
      (decimal)
      (octal)
      (char))))

==========
Comment in multiline directive with tab before
==========
mat_A: .word 1 02 '3'
             2 01 '2'	# comment
             3 02 '1'
---
(program
  (label)
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (octal)
      (char)
      (decimal)
      (octal)
      (char)
      (comment)
      (decimal)
      (octal)
      (char))))
