==========
Basic directive
==========
.text
---
(program
  (directive
    (mnemonic)))

==========
Directive with decimal
==========
.word 123
---
(program
  (directive
    (mnemonic)
    (attributes
      (decimal))))

==========
Directive with octal
==========
.word 012
---
(program
  (directive
    (mnemonic)
    (attributes
      (octal))))

==========
Directive with hexadecimal
==========
.word 0x01abCD
---
(program
  (directive
    (mnemonic)
    (attributes
      (hexadecimal))))

==========
Directive with char
==========
.word 'a'
---
(program
  (directive
    (mnemonic)
    (attributes
      (char))))

==========
Directive with float
==========
.float 0.213
---
(program
  (directive
    (mnemonic)
    (attributes
      (float))))

==========
Directive with string
==========
.asciiz "123"
---
(program
  (directive
    (mnemonic)
    (attributes
      (string))))

==========
Directive with string containing escaped characters
==========
.asciiz "12\n34\"56"
---
(program
  (directive
    (mnemonic)
    (attributes
      (string))))

==========
Directive with multiple arguments
==========
.set test "test" 123
---
(program
  (directive
    (mnemonic)
    (attributes
      (identifier)
      (string)
      (decimal))))

==========
Directive with multiple comma-separated arguments
==========
.set test,"test",123
---
(program
  (directive
    (mnemonic)
    (attributes
      (identifier)
      (string)
      (decimal))))
