==========
Basic instruction
==========
syscall
---
(program
  (instruction
    opcode: (opcode)))

==========
Instruction with register address
==========
la $t0, ($s0)
---
(program
  (instruction
    opcode: (opcode)
    operands: (operands
      (register)
      (address
        base: (register)))))

==========
Instruction with decimal offset address
==========
la $t0, -100($s0)
---
(program
  (instruction
    opcode: (opcode)
    operands: (operands
      (register)
      (address
        offset: (decimal)
        base: (register)))))

==========
Instruction with label offset address
==========
la $t0, test($s0)
---
(program
  (instruction
    opcode: (opcode)
    operands: (operands
      (register)
      (address
        offset: (symbol)
        base: (register)))))

==========
Instruction with label and decimal offset address
==========
la $t0, test+100($s0)
---
(program
  (instruction
    opcode: (opcode)
    operands: (operands
      (register)
      (address
        offset: (binary_expression
          left: (symbol)
          right: (decimal))
        base: (register)))))

==========
Basic directive
==========
.text
---
(program
  (directive
    mnemonic: (control_mnemonic)))

==========
Directive with decimal
==========
.word 123
---
(program
  (directive
    mnemonic: (integer_mnemonic)
    operands: (integer_operands
      (decimal))))

==========
Parenthesized expression
==========
add $t0, (base+4), $t1
---
(program
  (instruction
    opcode: (opcode)
    operands: (operands
      (register)
      (parenthesized_expression
        argument: (binary_expression
          left: (symbol)
          right: (decimal)))
      (register))))

==========
Unary expression
==========
add $t0, -base, $t1
---
(program
  (instruction
    opcode: (opcode)
    operands: (operands
      (register)
      (unary_expression
        argument: (symbol))
      (register))))
