==========
Empty line
==========

---
(program)

==========
Whitespace
==========
 
	
;
---
(program)

==========
Basic label
==========
test:
---
(program
  (label))

==========
Chained label without space
==========
test:test:
---
(program
  (label)
  (label))

==========
Chained label with space
==========
test: 	test:
---
(program
  (label)
  (label))

==========
Combined label and instruction
==========
test: nop
---
(program
  (label)
  (instruction
    (opcode)))

==========
Combined label and directive
==========
test: .text
---
(program
  (label)
  (directive
    (meta)))

==========
Instruction with multiple operands and comma, whitespace and comment
==========
li	 $t0  	 , 	   1	# comment
---
(program
  (instruction
    (opcode)
    (operands
      (register)
      (decimal)))
  (comment))

==========
Instruction with multiple operands without comma
==========
li	$t0	1
---
(program
  (instruction
    (opcode)
    (operands
      (register)
      (decimal))))

==========
Mars macro definition
==========
.macro inc(%rs %rt)
    addiu %rs, %rt, 1
.end_macro

inc($t0, $t1)
---
(program
  (directive
    (meta)
    (attributes
      (attribute)
      (attribute)
      (attribute)))
  (instruction
    (opcode)
    (operands
      (macro_variable)
      (macro_variable)
      (decimal)))
  (directive
    (meta))
  (macro))
