==========
[labels/whitespace] basic label
==========
test:
---
(program
  (global_label))

==========
[labels/whitespace] chained label without space
==========
test:test:
---
(program
  (global_label)
  (global_label))

==========
[labels/whitespace] chained label with space
==========
test: test:
---
(program
  (global_label)
  (global_label))

==========
[labels/whitespace] chained label with tab
==========
test:	test:
---
(program
  (global_label)
  (global_label))

==========
[labels/whitespace] label with leading space
==========
  test:
---
(program
  (global_label))

==========
[labels/whitespace] label with leading tab
==========
	test:
---
(program
  (global_label))

==========
[labels/whitespace] label with trailing space
==========
test:  
---
(program
  (global_label))

==========
[labels/whitespace] label with trailing tab
==========
test:	
---
(program
  (global_label))

==========
[instructions/whitespace] label with semicolon
==========
test:;
---
(program
  (global_label))

==========
[instructions/whitespace] label with space before semicolon
==========
test: ;
---
(program
  (global_label))
