==========
[instructions/address] address without offset
==========
foo ($s0)
---
(program
  (instruction
    (opcode)
    (operands
      (address
        (register)))))

==========
[instructions/address] address with decimal offset
==========
foo -100($s0)
---
(program
  (instruction
    (opcode)
    (operands
      (address
        (decimal)
        (register)))))

==========
[instructions/address] address with label
==========
foo bar($s0)
---
(program
  (instruction
    (opcode)
    (operands
      (address
        (symbol)
        (register)))))

==========
[instructions/address] address with simple expression offset
==========
foo bar+100($s0)
---
(program
  (instruction
    (opcode)
    (operands
      (address
        (binary_expression
          (symbol)
          (decimal))
        (register)))))

==========
[instructions/address] address with parenthesized expression offset
==========
foo (bar+0x123)($s0)
---
(program
  (instruction
    (opcode)
    (operands
      (address
        (parenthesized_expression
          (binary_expression
            (symbol)
            (hexadecimal)))
        (register)))))
