==========
[instructions/address] address without offset
==========
foo ($s0)
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      (address
        base: (register)))))

==========
[instructions/address] address with decimal offset
==========
foo -100($s0)
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      (address
        offset: (decimal)
        base: (register)))))

==========
[instructions/address] address with label
==========
foo bar($s0)
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      (address
        offset: (symbol)
        base: (register)))))

==========
[instructions/address] address with simple expression offset
==========
foo bar+100($s0)
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      (binary_expression
        left: (symbol)
        right: (address
          offset: (decimal)
          base: (register))))))

==========
[instructions/address] address with parenthesized expression offset
==========
foo (bar+0x123)($s0)
---

(program
  (instruction
    opcode: (opcode)
    operands: (operands
      (address
        offset: (parenthesized_expression
          argument: (binary_expression
            left: (symbol)
            right: (hexadecimal)))
        base: (register)))))
