==========
[instructions/integer] instruction with decimal value
==========
foo 100
---
(program
  (instruction
    (opcode)
    (operands
      (decimal))))

==========
[instructions/integer] instruction with signed integer value
==========
foo -100
---
(program
  (instruction
    (opcode)
    (operands
      (decimal))))

==========
[instructions/integer] instruction with octal value
==========
foo 012
---
(program
  (instruction
    (opcode)
    (operands
      (octal))))

==========
[instructions/integer] instruction with decimal value with leading zero
==========
foo 089
---
(program
  (instruction
    (opcode)
    (operands
      (decimal))))

==========
[instructions/integer] instruction with hexadecimal value
==========
foo 0x0314
---
(program
  (instruction
    (opcode)
    (operands
      (hexadecimal))))

==========
[instructions/integer] instruction with signed hexadecimal value
==========
foo -0x0123456789ABCDEFabcdef
---
(program
  (instruction
    (opcode)
    (operands
      (hexadecimal))))

==========
[instructions/integer] instruction with char value
==========
foo 'A'
---
(program
  (instruction
    (opcode)
    (operands
      (char))))

==========
[instructions/integer] instruction with escaped symbol
==========
foo '\n'
---
(program
  (instruction
    (opcode)
    (operands
      (char))))

==========
[instructions/integer] instruction with escaped single quote
==========
foo '\''
---
(program
  (instruction
    (opcode)
    (operands
      (char))))
