==========
[instructions/register] instruction with simple register
==========
foo $t0
---
(program
  (instruction
    (opcode)
    (operands
      (register))))

==========
[instructions/register] instruction with $0 numeric register
==========
foo $0
---
(program
  (instruction
    (opcode)
    (operands
      (register))))

==========
[instructions/register] instruction with $31 numeric register
==========
foo $31
---
(program
  (instruction
    (opcode)
    (operands
      (register))))

==========
[instructions/register] instruction with $gp register
==========
foo $gp
---
(program
  (instruction
    (opcode)
    (operands
      (register))))

==========
[instructions/register] instruction with $zero register
==========
foo $zero
---
(program
  (instruction
    (opcode)
    (operands
      (register))))

==========
[instructions/register] instruction with $f0 float register
==========
foo $f0
---
(program
  (instruction
    (opcode)
    (operands
      (register))))

==========
[instructions/register] instruction with $f31 float register
==========
foo $f31
---
(program
  (instruction
    (opcode)
    (operands
      (register))))
