==========
[directives/comment] comment on new line after integer directive
==========
.word 1 2
# comment
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)))
  (comment))

==========
[directives/comment] comment on new line after float directive
==========
.float 1.2 2.3
# comment
---
(program
  (directive
    (float_mnemonic)
    (float_operands
      (float)
      (float)))
  (comment))

==========
[directives/comment] inline comment following directive without arguments
==========
.text # comment
---
(program
  (directive
    (control_mnemonic))
  (comment))

==========
[directives/comment] inline comment following directive with single argument
==========
.align 4 # comment
---
(program
  (directive
    (control_mnemonic)
    (control_operands
      (decimal)))
  (comment))

==========
[directives/comment] inline comment following directive with multiple arguments
==========
.word 1, 2, 3, 4 # comment
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (decimal)))
  (comment))

==========
[directives/comment] comment in multiline directive
==========
mat_A: .word 1 2 3# comment
             4 5 6
---
(program
  (label)
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (comment)
      (decimal)
      (decimal)
      (decimal))))

==========
[directives/comment] comment in multiline directive with space before
==========
mat_A: .word 1 2 3 # comment
             4 5 6
---
(program
  (label)
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (comment)
      (decimal)
      (decimal)
      (decimal))))

==========
[directives/comment] comment in multiline directive with tab before
==========
mat_A: .word 1 2 3	# comment
             4 5 6
---
(program
  (label)
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (comment)
      (decimal)
      (decimal)
      (decimal))))

==========
[directives/comment] comment after multiline directive
==========
mat_A: .word 1 2 3
             4 5 6# comment
---
(program
  (label)
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (decimal)
      (decimal)
      (decimal)))
  (comment))

==========
[directives/comment] comment after multiline directive with space before
==========
mat_A: .word 1 2 3
             4 5 6 # comment
---
(program
  (label)
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (decimal)
      (decimal)
      (decimal)))
  (comment))

==========
[directives/comment] comment in multiline directive with tab before
==========
mat_A: .word 1 2 3
             4 5 6	# comment
---
(program
  (label)
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (decimal)
      (decimal)
      (decimal)))
  (comment))
