==========
[directives/comment] comment on new line after integer directive
==========
.word 1 2
# comment
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)))
  (comment))

==========
[directives/comment] comment on new line after float directive
==========
.float 1.2 2.3
# comment
---
(program
  (directive
    (float_mnemonic)
    (float_operands
      (float)
      (float)))
  (comment))

==========
[directives/comment] inline comment following directive without arguments
==========
.foo # comment
---
(program
  (directive
    (control_mnemonic))
  (comment))

==========
[directives/comment] inline comment following directive with single argument
==========
.foo 4 # comment
---
(program
  (directive
    (control_mnemonic)
    (control_operands
      (decimal)))
  (comment))

==========
[directives/comment] inline comment following directive with multiple arguments
==========
.word 1, 2 # comment
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)))
  (comment))

==========
[directives/comment] comment in multiline directive
==========
.word 1 2# comment
      3 4
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (comment)
      (decimal)
      (decimal))))

==========
[directives/comment] comment in multiline directive with space before
==========
.word 1 2 # comment
      3 4
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (comment)
      (decimal)
      (decimal))))

==========
[directives/comment] comment in multiline directive with tab before
==========
.word 1 2	# comment
      3 4
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (comment)
      (decimal)
      (decimal))))

==========
[directives/comment] comment after multiline directive
==========
.word 1 2
      3 4# comment
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (decimal)))
  (comment))

==========
[directives/comment] comment after multiline directive with space before
==========
.word 1 2
      3 4 # comment
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (decimal)))
  (comment))

==========
[directives/comment] comment after multiline directive with tab before
==========
.word 1 2
      3 4	# comment
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (decimal)))
  (comment))

==========
[directives/comment] comment on new line after multiline directive
==========
.word 1 2
      3 4
# comment
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal)
      (decimal)))
  (comment))
