==========
[directives/fields] macro directive
==========
.macro foo(%bar, %baz)
---
(program
  (directive
    mnemonic: (macro_mnemonic)
    name: (symbol)
    parameters: (macro_parameters
      (macro_variable)
      (macro_variable))))

==========
[directives/fields] integer directive
==========
.word 123
---
(program
  (directive
    mnemonic: (integer_mnemonic)
    operands: (integer_operands
      (decimal))))

==========
[directives/fields] integer directive
==========
.double 1.2
---
(program
  (directive
    mnemonic: (float_mnemonic)
    operands: (float_operands
      (float))))

==========
[directives/fields] string directive
==========
.string "foo"
---
(program
  (directive
    mnemonic: (string_mnemonic)
    string: (string)))

==========
[directives/fields] control directive
==========
.foo bar
---
(program
  (directive
    mnemonic: (control_mnemonic)
    operands: (control_operands
      (symbol))))
