==========
[directives/integer] directive with decimal
==========
.word 123
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal))))

==========
[directives/integer] directive with multiple space-separated decimals
==========
.word 1 2 3
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal))))

==========
[directives/integer] directive with integer values over multiple lines
==========
mat_A: .word 1 02 '3'
             2 01 '2'
             3 02 '1'
---
(program
  (label)
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (octal)
      (char)
      (decimal)
      (octal)
      (char)
      (decimal)
      (octal)
      (char))))

==========
[directives/integer] directive with multiple comma-separated decimals
==========
.word 1, 2, 3
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal))))

==========
[directives/integer] directive with multiple decimals and trailing space
==========
.word 1 2 3 
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (decimal)
      (decimal)
      (decimal))))

==========
[directives/integer] directive with octal
==========
.word 012
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (octal))))

==========
[directives/integer] directive with hexadecimal
==========
.word 0x01abCD
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (hexadecimal))))

==========
[directives/integer] directive with char
==========
.word 'a'
---
(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (char))))
