==========
[directives/macro] macro definition with percent (%) prefix
==========
.macro foo %bar %baz
---

(program
  (directive
    (macro_mnemonic)
    (macro_name)
    (macro_parameters
      (macro_parameter)
      (macro_parameter))))

==========
[directives/macro] macro definition with backslash (\) prefix
==========
.macro foo \bar \baz
---

(program
  (directive
    (macro_mnemonic)
    (macro_name)
    (macro_parameters
      (macro_parameter)
      (macro_parameter))))

==========
[directives/macro] macro definition with dollar ($) prefix
==========
.macro foo \bar \baz
---

(program
  (directive
    (macro_mnemonic)
    (macro_name)
    (macro_parameters
      (macro_parameter)
      (macro_parameter))))

==========
[directives/macro] macro definition with mixed prefixes
==========
.macro foo $\ $% \$ \% %$ $\
---

(program
  (directive
    (macro_mnemonic)
    (macro_name)
    (macro_parameters
      (macro_parameter)
      (macro_parameter)
      (macro_parameter)
      (macro_parameter)
      (macro_parameter)
      (macro_parameter))))

==========
[directives/macro] macro definition with parentheses without space before
==========
.macro foo(%bar %baz)
---

(program
  (directive
    (macro_mnemonic)
    (macro_name)
    (macro_parameters
      (macro_parameter)
      (macro_parameter))))

==========
[directives/macro] macro definition with parentheses with space before
==========
.macro foo (%bar %baz)
---

(program
  (directive
    (macro_mnemonic)
    (macro_name)
    (macro_parameters
      (macro_parameter)
      (macro_parameter))))

==========
[directives/macro] macro definition with parentheses and comma separation
==========
.macro foo(%bar, %baz)
---

(program
  (directive
    (macro_mnemonic)
    (macro_name)
    (macro_parameters
      (macro_parameter)
      (macro_parameter))))

==========
[directives/macro] integer directive with macro variable
==========
.word %foo
---

(program
  (directive
    (integer_mnemonic)
    (integer_operands
      (macro_variable))))

==========
[directives/macro] float directive with macro variable
==========
.float %foo
---

(program
  (directive
    (float_mnemonic)
    (float_operands
      (macro_variable))))

==========
[directives/macro] string directive with macro variable
==========
.asciiz %foo
---

(program
  (directive
    (string_mnemonic)
    (macro_variable)))
