==========
[directives/macro] macro definition with percent (%) prefix
==========
.macro foo %bar %baz
---
(program
  (directive
    (macro_mnemonic)
    (symbol)
    (macro_parameters
      (macro_variable)
      (macro_variable))))

==========
[directives/macro] macro definition with backslash (\) prefix
==========
.macro foo \bar \baz
---
(program
  (directive
    (macro_mnemonic)
    (symbol)
    (macro_parameters
      (macro_variable)
      (macro_variable))))

==========
[directives/macro] macro definition with dollar ($) prefix
==========
.macro foo \bar \baz
---
(program
  (directive
    (macro_mnemonic)
    (symbol)
    (macro_parameters
      (macro_variable)
      (macro_variable))))

==========
[directives/macro] macro definition with mixed prefixes
==========
.macro foo $\ $% \$ \% %$ $\
---
(program
  (directive
    (macro_mnemonic)
    (symbol)
    (macro_parameters
      (macro_variable)
      (macro_variable)
      (macro_variable)
      (macro_variable)
      (macro_variable)
      (macro_variable))))

==========
[directives/macro] macro definition with parentheses without space before
==========
.macro foo(%bar %baz)
---
(program
  (directive
    (macro_mnemonic)
    (symbol)
    (macro_parameters
      (macro_variable)
      (macro_variable))))

==========
[directives/macro] macro definition with parentheses with space before
==========
.macro foo (%bar %baz)
---
(program
  (directive
    (macro_mnemonic)
    (symbol)
    (macro_parameters
      (macro_variable)
      (macro_variable))))

==========
[directives/macro] macro definition with parentheses and comma separation
==========
.macro foo(%bar, %baz)
---
(program
  (directive
    (macro_mnemonic)
    (symbol)
    (macro_parameters
      (macro_variable)
      (macro_variable))))
